creditrs

In [1]:
import pandas as pd

In [2]:
columns = ['bank_name', 'credit_sum', 'free_days', 'credit_start']

smart_credit = pd.DataFrame(
                            [['Tinkoff', 40_000, 55, '2022-03-13'],
                            ['Sberbank', 100_000, 120, '2022-03-07'],
                            ['Alphabank', 100_000, 360, '2022-02-27']],
                            columns=columns
                            )

In [3]:
display(smart_credit)

   bank_name  credit_sum  free_days credit_start
0    Tinkoff       40000         55   2022-03-13
1   Sberbank      100000        120   2022-03-07
2  Alphabank      100000        360   2022-02-27

In [4]:
display(smart_credit.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   bank_name     3 non-null      object
 1   credit_sum    3 non-null      int64
 2   free_days     3 non-null      int64
 3   credit_start  3 non-null      object
dtypes: int64(2), object(2)
memory usage: 224.0+ bytes

None

In [5]:
smart_credit['credit_start'] = pd.to_datetime(smart_credit['credit_start'])

In [6]:
display(smart_credit.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   bank_name     3 non-null      object
 1   credit_sum    3 non-null      int64
 2   free_days     3 non-null      int64
 3   credit_start  3 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 224.0+ bytes

None

In [7]:
smart_credit['credit_end'] = (
                            smart_credit['credit_start']
                            + smart_credit['free_days']
                                .apply(lambda x: pd.Timedelta((x - 30), unit='D'))
                            )

In [8]:
# smart_credit['credit_end'] = (
#                             smart_credit['credit_start']
#                                 .apply(lambda x: pd.Timedelta(-3, unit='W'))
#                             )

In [9]:
display(smart_credit)

   bank_name  credit_sum  free_days credit_start credit_end
0    Tinkoff       40000         55   2022-03-13 2022-04-07
1   Sberbank      100000        120   2022-03-07 2022-06-05
2  Alphabank      100000        360   2022-02-27 2023-01-23

In [10]:

smart_credit['days_left'] = smart_credit['credit_end'] - smart_credit['credit_start']
display(smart_credit)

   bank_name  credit_sum  free_days credit_start credit_end days_left
0    Tinkoff       40000         55   2022-03-13 2022-04-07   25 days
1   Sberbank      100000        120   2022-03-07 2022-06-05   90 days
2  Alphabank      100000        360   2022-02-27 2023-01-23  330 days

In [15]:

smart_credit['monthly_payment'] = smart_credit['credit_sum'] / round(smart_credit['days_left'].dt.days / 30)
display(smart_credit)

,bank_name,credit_sum,free_days,credit_start,credit_end,days_left,monthly_payment
0,Tinkoff,40000,55,2022-03-13,2022-04-07,25 days,40000.000000
1,Sberbank,100000,120,2022-03-07,2022-06-05,90 days,33333.333333
2,Alphabank,100000,360,2022-02-27,2023-01-23,330 days,9090.909091